'''
    Площадь треугольника
Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.

    Формат входных данных
На вход программе подаётся два числа с плавающей точкой – длины катетов, каждое на отдельной строке.

    Формат выходных данных
Программа должна вывести одно число – площадь треугольника.
'''
a = float(input())
b = float(input())
s = a*b*1/2
print(s)

# урок пройден