'''
    Цвет настроения синий
Напишите программу, которая считывает одну строку, 
после чего выводит «YES», если в введенной строке есть подстрока «синий» и 
«NO» в противном случае.

    Формат входных данных
На вход программе подается одна строка.

    Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
'''

# s = str(input())
# if 'синий' in s:
#     print('YES')
# else:
#     print('NO')

'''
    Отдыхаем ли?
Напишите программу, которая считывает одну строку, после чего выводит «YES», 
если в введённой строке есть подстрока «суббота» или «воскресенье», 
и «NO» в противном случае.

    Формат входных данных
На вход программе подается одна строка.

    Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
'''
# s = str(input())
# if ('суббота' in s) or ('воскресенье' in s):
#     print('YES')
# else:
#     print('NO')

'''
    Корректный email
Будем считать email адрес корректным, если в нем есть символ собачки (@) и точки. 
Напишите программу проверяющую корректность email адреса.

    Формат входных данных
На вход программе подаётся одна строка – email адрес.

    Формат выходных данных
Программа должна вывести строку «YES», если email адрес является корректным и «NO» в ином случае.

Примечание. Наличие символов @ и . недостаточно для корректности email адреса, 
однако их отсутствие гарантировано влечёт за собой неверный email.
'''
# s = str(input())
# if ('@' in s) and ('.' in s):
#     print('YES')
# else:
#     print('NO')

# урок пройден
