'''
    Таблица-1
Дано натуральное число n (n ≤ 9). 
Напишите программу, которая печатает таблицу размером n×3 
состоящую из данного числа (числа отделены одним пробелом).

    Формат входных данных
На вход программе подается одно натуральное число.

    Формат выходных данных
Программа должна вывести таблицу размером n×3 состоящую из данного числа.

Примечание. В конце строки может быть пробел.
'''
# n = int(input())
# for i in range (1, n + 1):
#     for j in range(3):
#         print(n, end=" ")
#     print()     

'''
    Таблица-2
Дано натуральное число n, (n ≤ 9). 
Напишите программу, которая печатает таблицу размером n×5, 
где в i-ой строке указано число i (числа отделены одним пробелом).

    Формат входных данных
На вход программе подается одно натуральное число.

    Формат выходных данных
Программа должна вывести таблицу размером n×5 в соответствии с условием.

Примечание. В конце строки может быть пробел.
'''
# n = int(input())
# for i in range (1,n+1):
#     for j in range(5):
#         print(i, end=" ")
#     print()    

'''
    Таблица-3
Дано натуральное число n(n ≤ 9). 
Напишите программу, которая печатает таблицу сложения 
для всех чисел от 1 до n в соответствии с примером.

    Формат входных данных
На вход программе подается одно натуральное число.

    Формат выходных данных
Программа должна вывести таблицу сложения для всех чисел от 1 до n.

Примечание. В конце строки может быть пробел.
'''
# n = int(input())
# for i in range(1, n + 1):
#     for j in range(1, 9 + 1):
#         print(i, "+", j, "=", i+j, end="\n")
#     print()    
