'''
Напишем программу, которая определяет есть ли в числе цифра 7
'''
# num = int(input())
# has_seven = False  # сигнальная метка
# while num != 0:
#     last_digit = num % 10
#     if last_digit == 7:
#         has_seven = True
#     num = num // 10
# if has_seven == True:
#     print('YES')
# else:
#     print('NO')

'''
    Обратный порядок 1
Дано натуральное число. 
Напишите программу, которая выводит его цифры в столбик в обратном порядке.

    Формат входных данных 
На вход программе подается одно натуральное число.

    Формат выходных данных
Программа должна вывести цифры введенного числа в столбик в обратном порядке.
'''
# num = int(input())
# while num!=0:
#     x = num % 10
#     num = num // 10
#     print(x)

'''
    Обратный порядок 2
Дано натуральное число. Напишите программу, которая меняет порядок цифр числа на обратный.

    Формат входных данных 
На вход программе подается одно натуральное число.

    Формат выходных данных
Программа должна вывести число записанное в обратном порядке.  
'''
# num = int(input())
# while num!=0:
#     x = num % 10
#     num = num // 10
#     print(x, end='')

