'''
    Список чисел
На вход программе подается одно число n. 
Напишите программу, которая выводит список [1, 2, 3, ..., n].
    Формат входных данных
На вход программе подается одно натуральное число.
    Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
'''
# n = int(input())
# numbers = list(range(1, n+1, 1))
# print(numbers)


'''
    Список букв
На вход программе подается одно число n. 
Напишите программу, которая выводит список, 
состоящий из n букв английского алфавита ['a', 'b', 'c', ...] в нижнем регистре.
    Формат входных данных
На вход программе подается натуральное число n≤26.
    Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
'''
# n = int(input())
# chars = []
# numders = (list(range(97, 97+n, 1)))
# for i in numders:
#     chars.append(chr(i))
# print(chars) # первый вариант

# n = int(input())
# chars = list(chr(i) for i in range(97, 97 + n))
# print(chars) # второй вариант

