'''
    Python is awesome
Напишите программу, которая выводит слова «Python is awesome!» 
(без кавычек) 10 раз.

    Формат выходных данных
Программа должна вывести 10 раз текст «Python is awesome!», 
каждый на отдельной строке.
'''
# for i in range(10):
#     print("Python is awesome!")


'''
    Повторяй за мной 1
Дано предложение и количество раз которое его надо повторить. 
Напишите программу, которая повторяет данное предложение 
нужное количество раз.

    Формат входных данных
В первой строке записано текстовое предложение, 
во второй — количество повторений.

    Формат выходных данных
Программа должна вывести указанное текстовое предложение 
нужное количество раз. Каждое повторение должно начинаться с новой строки.
'''
# data = input()
# x = int(input())
# for i in range(x):
#     print(data)

'''
    Последовательность символов
Напишите программу, которая использует ровно три цикла for для 
печати следующей последовательности символов:
6 * AAA
5 * BBB
E
9 * TTT
G
'''
# for i in range(6):
#     print("AAA")
# for i in range(5):
#     print("BBBB")
# print("E")
# for i in range(9):
#     print("TTTTT")    
# print("G")    


'''
    Звездный прямоугольник
На вход программе подается натуральное число n.
Напишите программу, которая печатает звездный прямоугольник 
размерами n × 19(*).

    Формат входных данных
На вход программе подаётся натуральное число 
n∈[1;20] — высота звездного прямоугольника.

    Формат выходных данных
Программа должна вывести звездный прямоугольник размерами n×19.

Подсказка. Для печати звездной линии используйте умножение строки на число.
'''
# n = int(input())
# for i in range(n):
#     print("*"*19)
