'''
    Повторяй за мной 2
Напишите программу, которая считывает одну строку текста 
и выводит 10 строк, пронумерованных от 0 до 9, 
каждая с указанной строкой текста.

    Формат входных данных
На вход программе подается одна строка текста.

    Формат выходных данных
Программа должна вывести десять строк в соответствии с условием задачи.
'''
# text = input()
# for i in range(10):
#     print(i, text)

'''
    Квадрат числа
На вход программе подается натуральное число n. 
Напишите программу, которая для каждого из чисел от 0 до n (включительно) 
выводит фразу: «Квадрат числа [число] равен [число]» (без кавычек).

    Формат входных данных
На вход программе подается натуральное число nn.

    Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
'''
# x = int(input())
# for i in range(x+1):
#     print("Квадрат числа", i, "равен", i**2)

'''
    Звездный треугольник
На вход программе подается натуральное число n, 
n ≥ 2 – катет прямоугольного равнобедренного треугольника.
Напишите программу, которая выводит звездный треугольник 
в соответствии с примером.

    Формат входных данных
На вход программе подается одно натуральное число(n≥2).

    Формат выходных данных
Программа должна вывести треугольник в соответствии с условием задачи.
'''
# n = int(input())
# for i in range(n):
#     print("*" * (n - i))

'''
    Популяция
На вход программе подается три натуральных числа m,p,n:
m:стартовое количество организмов;
p:среднесуточное увеличение в %;
n:количество дней для размножения.
Напишите программу, которая предсказывает размер популяции организмов. 
Программа должна выводить размер популяции в каждый день, 
начиная с 1 и заканчивая n-м днем.

    Формат входных данных
На вход программе подается три натуральных числа.

    Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
'''
# m = int(input())
# p = int(input())
# n = int(input())
# for i in range(n):
#     print(i+1, m*(1 + p / 100)**i)

