'''
    Абсолютная сумма
Даны пять чисел a1, a2, a3, a4, a5. 
Напишите программу, которая вычисляет сумму их модулей |a_1| + |a_2| +|a_3| +|a_4| + |a_5|

    Формат входных данных
На вход программе подается пять действительных чисел a1, a2, a3, a4, a5, каждое на отдельной строке.

    Формат выходных данных
Программа должна вывести одно число – сумму модулей введённых чисел.
'''
a1 = abs(float(input()))
a2 = abs(float(input()))
a3 = abs(float(input()))
a4 = abs(float(input()))
a5 = abs(float(input()))
print(a1 + a2 +a3 +a4 + a5)

# урок пройден