'''
    Количество членов
На вход программе подается последовательность слов, каждое слово на отдельной строке. 
Концом последовательности является одно из трех слов: «стоп», «хватит», «достаточно» 
(маленькими буквами, без кавычек). 
Напишите программу, которая выводит общее количество членов данной последовательности.

    Формат входных данных
На вход программе подается последовательность слов, каждое слово на отдельной строке.

    Формат выходных данных
Программа должна вывести общее количество членов данной последовательности.
'''
# text = input()
# count = 0
# while (text != "стоп") and (text != "хватит") and (text != "достаточно"):
#     count += 1
#     text = input()
# print(count)    


'''
    Пока делимся
На вход программе подается последовательность целых чисел делящихся на 7, 
каждое число на отдельной строке. 
Концом последовательности является любое число не делящееся на 7. 
Напишите программу, которая выводит члены данной последовательности.

    Формат входных данных
На вход программе подается последовательность чисел, 
каждое число на отдельной строке.

    Формат выходных данных
Программа должна вывести члены данной последовательности.
'''
# a = int(input())
# while a % 7 == 0:
#     print(a)
#     a = int(input())